Repository: JefferssonSemin/xpe-final
Catalog: Delivery.Exception/ResourceErrorMessages.*.resx
Languages: pt_br

# UNKOWN_ERROR
source: Unknown error
pt_br: Erro desconhecido

# NAME_REQUIRED
source: Name is required
pt_br: Nome é obrigatório

# EMAIL_REQUIRED
source: Email is invalid
pt_br: Email é inválido

# CPF_REQUIRED
source: Cpf is required
pt_br: Cpf é obrigatório

source: Deliveryman not found
pt_br: Entregador não encontrado!

# INVALID_DATE_OF_BIRTH
source: Date of birth is invalid.
pt_br: Data de aniversário é inválida!

# INVALID_PASSWORD
source: Invalid password. Please make sure the password contains at least 6 characters.
pt_br: Senha inválida. Por favor verifique se a senha contém no minimo 6 caracteres.

# USERNAME_REQUIRED
source: Username must not be empty
pt_br: Username não pode ser vazio

# ROLE_REQUIRED
source: Role is required
pt_br: O tipo do usuário é obrigatório

source: User not found
pt_br: Usuário não encontrado

# USERNAME_EXISTS
source: Username already exists
pt_br: O Username já está sendo utilizado.

# UNHAUTORIZED_ERROR
source: Username or password are invalid!
pt_br: Username ou senha estão inválidos

# TITLE_REQUIRED
source: Title is required
pt_br: O título é obrigatório

# THUMB_REQUIRED
source: Url thumb is required
pt_br: A url da thumbail é obrigatória

# URLVIDEO_REQUIRED
source: Url video is required
pt_br: A url do video é obrigatória

# DURATION_MAX_LIMIT
source: The video cannot be longer than 5 minutes
pt_br: O vídeo não pode ter mais de 5 minutos

# FEED_NOT_FOUND
source: Does not possible like the feed
pt_br: Não foi possível curtir a publicação

# CODE_REQUIRED
source: Cod is required
pt_br: Código é obrigatório

# DESCRIPTION_REQUIRED
source: Description is required
pt_br: Descrição é obrigatório

# UNIT_MEASURE_REQUIRED
source: Unit measure is required
pt_br: Unidade de medida é requirido
